Repository: hans/pyggs
Catalog: locale/*/LC_MESSAGES/pyggs.po
Languages: cs

source: Please, input a value from {0}.
cs: Zadejte, prosím, jednu z hodnot {0}.

source: y
cs: a

source: yes
cs: ano

source: no
cs: ne

source: Please, answer yes/no (y/n).
cs: Odpovězte, prosím, ano/ne (a/n).

source: Use only digits, please.
cs: Vložte prosím pouze číslice.

source: Please, input a decimal number.
cs: Zadejte, prosím, desetinné číslo (s desetinnou tečkou).

source: Please, use only alpha-numeric characters.
cs: Používejte prosím pouze písmena a číslice.

source: Please, input a non-empty string.
cs: Zadejte, prosím, neprázdný řetězec.

source: ERROR
cs: CHYBA

source: Please, chose an option from the list - input a number, or a full text of the desired option.
cs: Vyberte, prosím, volbu ze seznamu - zadejte číslo, nebo úplný textový název volby.

source: Select
cs: Výběr

source: Unknown cache type '{0}'.
cs: Neznámý typ keše '{0}'.

source: This theme has no section {0}.
cs: Tento styl nemá sekci {0}.

source: Cannot parse color {0}.
cs: Nepodařilo se naparsovat barvu {0}.

source: Upgrading plugin data from Pyggs version {0} to {1}.
cs: Aktualizuji data pluginu z Pyggs verze {0} na {1}.

source: Upgrade script failed.
cs: Aktualizační skript selhal.

source: Upgrading plugin data from plugin version {0} to {1}.
cs: Aktualizuji data pluginu z verze {0} na {1}.

source: There is no field '{0}' in the result set.
cs: Pole '{0}' v datech neexistuje.

source: Global storage for detailed info about caches.
cs: Globální uložiště podrobností o keších.

source: Cache details data timeout in days:
cs: Platnost uložených podrobností o keši v dnech:

source: Fixing change of cache type name Unknown - Mystery/Puzzle.
cs: Upravuji název typu keší Uknown - Mystery/Puzzle.

source: Deleting data for caches with missing guid.
cs: Mažu data pro keše bez guidu.

source: Creating column for elevation in cache database.
cs: Vytvářím sloupec pro výšková data v databázi keší.

source: Updating cache database with elevation data... this may take a while.
cs: Aktualizuji výšková data v databázi keší... tato operace může chvíli trvat.

source: Elevation data download failed, re-trying in {0} seconds...
cs: Stažení výškových dat selhalo, zkusím znovu za {0} sekund...

source: Elevation data download failed.
cs: Stažení výškových dat selhalo.

source: Updating Cache database for {0}: {1}.
cs: Aktualizuji data v databázi keší pro {0}: {1}.

source: No guid passed, not updating.
cs: Nebyl zadán guid, nemůžu provést aktualizaci.

source: Statistics of found caches by type, size and country.
cs: Statistika nalezených keší podle typu, velikosti a země.

source: Adds rows about most distant, most southern, oldest etc. caches found into General statistics section.
cs: Přidá řádky o nejvzdálenější, nejižnější, nejstarší, atd. keši do sekce Celková statistika.

source: Difficulty / Terrain matrix of found caches.
cs: Matice Obtížnost / Terén nalezených keší.

source: Adds graph and average value of finds by elevation.
cs: Generuje graf a průměrné hodnoty nalezených keší podle nadmořské výšky.

source: This plugin is just simple example.
cs: Toto je pouze jednoduchý příklad pluginu.

source: Updates geocaching.com profile with generated statistics.
cs: Aktualizuje profil na geocaching.com vygenerovanými statistikami.

source: Force geocaching.com profile update on every run ({CHOICES})?
cs: Vynutit aktualizaci profilu při každém spuštění ({CHOICES})?

source: Export file not found.
cs: Soubor s exportem nenalezen.

source: Geocaching.com profile seems already up to date, skipping update.
cs: Profil na geocaching.com se zdá být aktuální, přeskakuji jeho aktualizaci.

source: Storage for geocaching.cz credentials etc.
cs: Uložiště pro přihlašovací údaje na geoaching.cz

source: Geocaching.cz username:
cs: Uživatelské jméno na geocaching.cz:

source: Geocaching.cz password:
cs: Heslo na geocaching.cz:

source: UID (for map generating):
cs: UID z geocaching.cz (pro generování map):

source: Storage for user's ratings of caches from geocaching.cz.
cs: Uložiště pro vlastní hodnocení keší z geocaching.cz.

source: Timeout for stored geocaching.cz ratings of the user in hours:
cs: Platnost uložených vlastních hodnocení z geocaching.cz v hodinách:

source: Preparing new version of cache ratings storage.
cs: Připravuji nové uložiště pro hodnocení keší.

source: Geocaching.cz MyRatings database out of date, initiating refresh.
cs: Platnost databáze vlastních hodnocení z geocaching.cz vypršela, zahajuji aktualizaci.

source: Unable to load Geocaching.cz MyRatings, extending validity of current data.
cs: Nepodařilo se načíst vlastní hodnocení z geocaching.cz, prodlužuji platnost stávajících dat.

source: Geocaching.cz MyRatings database successfully updated.
cs: Databáze vlastních hodnocení z geocaching.cz úspěšně aktualizována.

source: List of top 10 user rated caches.
cs: Seznam 10 nejlépe hodnocených keší uživatelem.

source: Global storage for ratings of caches from geocaching.cz.
cs: Globální uložiště pro hodnocení z geocaching.cz.

source: Timeout for stored geocaching.cz ratings in days:
cs: Platnost uložených hodnocení z geocaching.cz v dnech:

source: Geocaching.cz Ratings database out of date, initiating refresh.
cs: Platnost databáze hodnocení z geocaching.cz vypršela, zahajuji aktualizaci.

source: Unable to load Geocaching.cz Ratings, extending validity of current data.
cs: Nepodařilo se načíst hodnocení z geocaching.cz, prodlužuji platnost stávajících dat.

source: Geocaching.cz Ratings database successfully updated.
cs: Databáze hodnocení z geocaching.cz úspěšně aktualizována.

source: Adds rows about worst/best rated cache found into General statistics section.
cs: Přidá řádky o nejlepší/nejhorší nalezené keši do sekce Celková statistika.

source: Updates user's finds in geocaching.cz database.
cs: Aktualizuje nálezy uživatele v databázi geocaching.cz.

source: Force my finds update on every run ({CHOICES})?
cs: Vynutit aktualizaci nálezů při každém spuštění ({CHOICES})?

source: Geocaching.cz database seems already up to date, skipping update.
cs: Nálezy na geocaching.cz se zdají být aktuální, přeskakuji jejich aktualizaci.

source: Unable to update Geocaching.cz database.
cs: Nepodařilo se aktualizovat nálezy na geocaching.cz.

source: Geocaching.cz database successfully updated.
cs: Nálezy na geocaching.cz úspěšně aktualizovány.

source: Container for General statistics table.
cs: Tabulka pro sekci Celková statistika.

source: Maps of Czech Republic from geocaching.cz.
cs: Mapy České republiky z geocaching.cz.

source: Map of Europe from geocaching.cz & world66.com.
cs: Mapa Evropy z geocaching.cz & world66.com.

source: List of accomplished milestones.
cs: Seznam dosažených milníků.

source: Please specify milestones as coma separeted list. You can also use regular expressions, e.g. '[0-9]+00' matches 100, 200, 300, ... and magic word LAST means the last found cache.
cs: Zadejte prosím milníky oddělené čárkou. Můžete také použít regulární výrazy, např. '[0-9]+00' odpovídá 100, 200, 300, ... a slovo LAST zastupuje poslední nalezenou keš.

source: Milestones:
cs: Milníky:

source: Storage for My Finds data from geocaching.com profile.
cs: Uložiště pro My Finds data z profilu na geocaching.com.

source: My Finds data timeout in hours:
cs: Platnost uložených My Finds dat v hodinách:

source: New version of Pyggs: forcing database update.
cs: Detekována nová verze Pyggs: databáze nálezů bude aktualizována.

source: Updating MyFinds database.
cs: Aktualizuji databázi nálezů.

source: Got zero myFinds records (bug?) and local databse is empty too.
cs: Stažený seznam nálezů je prázdný (bug?) a lokální databáze taktéž.

source: Got zero myFinds records (bug?), leaving old database in place.
cs: Stažený seznam nálezů je prázdný (bug?), ponechávám starou databázi.

source: MyFinds database out of date, initiating refresh.
cs: Platnost databáze nálezů vypršela, zahajuji aktualizaci.

source: Adds rows about average finds (overall, in last 365 days) into General statistics section.
cs: Přidá řádky s průměrnými údaji o nálezech (celkově, za posledních 365 dní) do sekce Celková statistika.

source: Adds graph and average find values for every user's caching year.
cs: Graf nálezů a průměrné hodnoty z každého roku.

source: Adds rows about user's top day, week, month etc. into General statistics section.
cs: Přidá řádky o nejúspěšnějším dnu, týdnu, měsíci, ... do sekce Celková statistika.

source: Generates statistics html page.
cs: Generuje HTML stránku se statistikami.

source: Generates page with the list of found but unrated caches by user.
cs: Vygeneruje stránku se seznamem nalezených, ale neohodnocených keší uživatele.

source: Entering setup menu for profile {0}.
cs: Otevírám menu s nastavením pro profil {0}.

source: Exit
cs: Konec

source: General options
cs: Obecná nastavení

source: Output
cs: Výstup

source: Enable/Disable plugins
cs: Zapnout/Vypnout pluginy

source: Plugins settings
cs: Nastavení pluginů

source: Main menu
cs: Hlavní nabídka

source: Action:
cs: Akce:

source: Entering full setup for profile {0}.
cs: Zahajuji kompletní nastavení profilu {0}.

source: Unable to create working directory {0}.
cs: Nepodařilo se vytvořit pracovní adresář {0}.

source: Unable to set up base directory structure in working directory {0}.
cs: Nepodařilo se vytvořit základní adresářovou strukturu v pracovním adresáři {0}.

source: Working directory is {0}.
cs: Pracovního adresář je {0}.

source: Unable to create profile directory {0}.
cs: Nepodařilo se vytvořit adresář profilu {0}.

source: Please, select user interface language ({CHOICES}).
cs: Vyberte prosím jazyk uživatelského rozhraní ({CHOICES}).

source: Enter your home coordinates in degrees as decimal number (N means positive value, S negative; E means positive value, W negative).
cs: Zadejte domovské souřadnice jako desetinné číslo ve stupních (N jsou kladné hodnoty, S záporné; E jsou kladné hodnoty, W záporné).

source: Latitude:
cs: Zeměpisná šířka:

source: Please, use decimal number.
cs: Vložte prosím desetinné číslo (s desetinnou tečkou).

source: Longitude:
cs: Zeměpisná délka:

source: Username:
cs: Uživatelské jméno:

source: Password:
cs: Heslo:

source: Templates are looked up in these directories (consecutively):
cs: Šablony se hledají v těchto adresářích (popořadě):

source: Template ({CHOICES}):
cs: Šablona ({CHOICES}):

source: Themes are looked up in these directories (consecutively):
cs: Motivy se hledají v těchto adresářích (popořadě):

source: Theme ({CHOICES}):
cs: Motiv ({CHOICES}):

source: Output directory:
cs: Adresář pro výstup:

source: You have to input existing directory.
cs: Musíte zadat existující adreář.

source: Plugins
cs: Pluginy

source: Enable
cs: Aktivovat

source: Enable/Disable plugins menu
cs: Nabídka zapnout/vypnout pluginy

source: Plugins:
cs: Pluginy:

source: Cannot disable plugin {0}, because {1} depend on it.
cs: Není možné vypnout plugin {0}, jelikož na něm závisí {1}.

source: Disabling plugin {0}.
cs: Vypínám plugin {0}.

source: Enabling plugin {0}.
cs: Zapínám plugin {0}.

source: Configuration of
cs: Nastavení

source: Plugin {0} pulled in as dependency.
cs: Plugin {0} přidán jako závislost.

source: Plugins settings menu
cs: Nastavení jednotlivých pluginů

source: Note: You can always edit these setings by running pyggs with --setup (-s) switch.
cs: Poznámka: Tato nastavení můžete kdykoliv změnit spuštěním pyggs se --setup (-s) přepínačem.

source: Preparing plugin {0}...
cs: Připravuji plugin {0}...

source: Running plugin {0}...
cs: Spouštím plugin {0}...

source: Invalid ouput directory {0}.
cs: Chybný adresář {0} pro výstup.

source: Finishing plugin {0}...
cs: Dokončuji plugin {0}...

source: Loading plugin {0}.
cs: Načítám plugin {0}.

source: Missing dependencies {0}.
cs: Chybějící závislosti {0}.

source: Cannot make plugin depedency tree for {0}. Possible circular dependencies.
cs: Nemohu sestavit strom závislostí pluginů pro {0}. Pravděpodobně z důvodu cyklických závislostí.

source: Cannot find template {0}.
cs: Šablona {0} nenalezena.

source: Cannot find theme {0}.
cs: Motiv {0} nenalezen.

source: Could not fetch URL {0}.
cs: Nepodařilo se stáhnout data z {0}.

source: Got error code {0} while fetching {1}.
cs: Chyba {0} při stahování {1}.

source: choose profile
cs: nastavit profil

source: disable usage of colored output
cs: vypne používání barevného výstupu

source: run setup script
cs: spustí nastavení

source: set working directory, default is {0}
cs: nastavení pracovního adresáře, výchozí je {0}

source: set logging to ERROR
cs: nastavit logování na ERROR

source: set logging to INFO
cs: nastavit logování na INFO

source: set logging to DEBUG
cs: nastavit logování na DEBUG

source: set logging to ALL
cs: nastavit logování na ALL

source: You need at least Python {0} to run this script.
cs: Pro běh tohot skriptu potřebujete Python verze {0} nebo vyšší.

source: Detected incompatible version of working directory {0}. Please, delete the directory and set up your profiles from start.
cs: Nalezena nekompatibilní verze pracovního adresáře {0}. Prosím, vymažte adresář a znovu nastavte své profily.

source: Do you want to delete the working directory and enter the setup script now ({CHOICES})?
cs: Chcete nyní vymazat pracovní adresář a spustit nastavení profilu ({CHOICES})?

source: Deleting content of working directory {0}.
cs: Mažu obsah pracovního adresáře {0}.

source: Updating environment variables in global storage.
cs: Aktualizuji proměnné v globálním uložišti.

source: Working directory is not set up properly, initiating setup script.
cs: Pracovní adresář není připraven, spouštím nastavení.

source: No profile name given, auto-chosing the only available profile '{0}'.
cs: Nebylo zadáno žádné jméno profilu, automaticky předpokládám jediný dostupný profil '{0}'.

source: Create new
cs: Vytvořit nový

source: No profile name given, please select your profile.
cs: Nebylo zadáno žádné jméno profilu, vyberte prosím profil.

source: Profile name
cs: Jméno profilu

source: Profile '{0}' does not exist, creating profile directory and initiating setup script.
cs: Profil '{0}' neexistuje, vytvářím adresář profilu a zahajuji nastavení.

source: Updating environment variables in profile storage.
cs: Aktualizuji proměnné v uživatelském uložišti.
